#+TITLE: RESME - A Resume Generator
#+AUTHOR: Adolfo Villafiorita
#+DATE: <2020-07-14 Tue>
#+STARTUP: showall

Keep your resume in YAML and output it in various formats, including
Org Mode, Markdown, and JSON.

The rendering engine is based on ERB. This simplifies the creation of
new output formats (and extending/modifying the YML structure to one's
needs).

#+BEGIN_QUOTE
Support for the Europass XML format has been dropped in version 1.0.0, as the
version generated by resme (Europass schema version 3.3.0) is no longer
supported by the Europasss website and documentation about the changes to make
it working again are kind of difficult to retrieve.
#+END_QUOTE

** Usage
   :PROPERTIES:
   :CUSTOM_ID: usage
   :END:

Start with:

#+begin_example sh
  resme init
#+end_example

which generates a YML template for your resume in the current directory.
Comments in the YML file should help you fill the various entries.
Notice that most entries are optional and you can remove sections which
are not relevant for your resume.

You can now generate a resume using one of the existing formats:

#+begin_example sh
  resme --to org resume.yml
#+end_example

Supported formats include:

- =org=: Org Mode format
- =md=: Markdown format
- =json=: JSON format (https://jsonresume.org/)

If you are not satisfied with the provided templates, you can write your own
(see below).

Notice that you can specify more than one YML file in input. This allows you to
store data about your resume in different files, if you like to do so (e.g.,
work experiences could be in one file and talks in another).  The YML files are
merged before processing them.

Full syntax:

#+begin_src sh :results raw output :wrap example
resme help
#+end_src

#+RESULTS:
#+begin_example
resme command [options] [args]
Available commands:
  check resume.yml # Check syntax of resume.yml
  list resume.yml # List main sections in resume.yml
  version # print version information
  view --template FORMAT # Print template used for format
  generate [options] resume.yml ... # output resume
  console # enter the console
  man # print resme manual page
  help [command] # print command usage
  init [options] # generate an empty resume.yml file
#+end_example

